# GroupPropagationUserCancelled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..GroupPropagationUserCancelled Property
BuiltInFailures..::..GroupFailures Class See Also
---
Changes to Group "[Type Name]" have been cancelled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupPropagationUserCancelled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupPropagationUserCancelled As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupPropagationUserCancelled {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace